{
  "articles": [
    {
      "id": 1,
      "type": "article",
      "title": "Navigating Technical Debt as an Engineering Leader",
      "previewImage": "help.png",
      "mediumUrl": "https://medium.com/@becki.wordsworth/navigating-technical-debt-as-a-engineering-leader-eaca48a84cc1",
      "previewText": "Technical Debt. Whatever your role, it’s probably a term that fills you with dread. While we have all worked with it in one capacity or another, as an engineering leader, it’s your job to navigate the challenges and build strategies for managing technical debt effectively, so everyone can have fewer sleepless nights!"
    },
    {
      "id": 2,
      "type": "article",
      "title": "Cracking the Code: Navigating the First Week as a Junior Developer",
      "previewImage": "junior.png",
      "mediumUrl": "https://medium.com/@becki.wordsworth/cracking-the-code-navigating-the-first-week-as-a-junior-developer-demystifying-expectations-and-c6cb3a4d776a",
      "previewText": "Joining an organisation as a junior developer can bring with it a number of questions and the biggest one is often ‘what is expected of me? Your are likely navigating a full team of developers, of various levels, for the first time ..."
    },
    {
      "id": 3,
      "type": "article",
      "title": "Making the most of office days for a hybrid team",
      "previewImage": "team.png",
      "mediumUrl": "https://medium.com/@becki.wordsworth/making-the-most-of-office-days-for-a-hybrid-team-6bc3b5f3ea41",
      "previewText": "Cards on the table, I like working hybrid. I know it’s not the popular opinion nowadays, but I do. I like the flexibility of being able to work at home but I also like going to the office and socialising with real life people from time to time. My team has been working hybrid since the end of the ..."
    },
    {
      "id": 4,
      "type": "article",
      "title": "Your first role in tech won’t be perfect — and it doesn’t have to be",
      "previewImage": "lovejob.png",
      "mediumUrl": "https://medium.com/@becki.wordsworth/your-first-role-in-tech-wont-be-perfect-and-it-doesn-t-have-to-be-694d89fa6237",
      "previewText": "Searching for your first developer role after a bootcamp, University, or self study can be hard. No one gets the first job they apply for and during the process you will question everything — is my code not perfect enough? Is my job title confusing? ..."
    },
    {
      "id": 5,
      "type": "article",
      "title": "What to expect when making the leap from developer to Tech Lead",
      "previewImage": "techlead.png",
      "mediumUrl": "https://medium.com/@becki.wordsworth/what-to-expect-when-making-the-leap-from-developer-to-tech-lead-fdabd123c42a",
      "previewText": "When I started my career in tech, leadership wasn’t really something I was thinking about — my aim was just on becoming the best programmer I could be ...."
    }
  ]
}